#!/bin/sh

########## Format of Case File #########
# 1. 忽略空行，忽略以"校验"二字开头的行
# 2. 正常、异常加中文冒号的字符串将被当作关键字
# 3. 其它行将被当作一条测试用例，行中中文冒号后面的被当作测试数据
# 4. 测试数据带中文顿号的，将被当作两条测试item来处理
#--------------case_file----------------
# 校验flags
#
# 正常：check_flags
# flags取最小值：0
# flags取最大值：65535
# flags取其它合法值：32423
#
# 异常：ab_check_flags
# flags取负数：-1
# flags大于65535：65536
# flags取浮点数：1.0
#
# 校验key
# 正常：check_key
# key由数字，字母和下划线组成：123、abc、123abc、_123abc 
# key含半角标点符号：，;`!@#$%^&*(){+=|<>?."[\/
########################################
case_file=$1

awk -F'：' -f gen_keyword.awk $1
